sbm_unit_test/0_org/nut
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    outlet
    {
        type        calculated;
        value       $internalField;
    }

    inlet
    {
        type        calculated;
        value       $internalField;
    }

    wall
    {
        type        nutkWallFunction;
        value       uniform 0;
    }

    defaultFaces
    {
        type        zeroGradient;
    }

}

// ************************************************************************* //
