sbm_unit_test/system/FOs/FOwriteCellCentres
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

writeCellCentres1
{
    // Mandatory entries
    type            writeCellCentres;
    libs            (fieldFunctionObjects);

    // Optional
    enabled         true;
    log		        true;
    timeStart       0;
    timeEnd         0;
    executeControl  writeTime;
    executeInterval -1;
    writeControl 	writeTime;
    writeInterval   -1;

    
    // Optional (inherited) entries
    // region          region0;
    // enabled         true;
    // log             true;
    // timeStart       0;
    // timeEnd         1000;
    // executeControl  writeTime;
    // executeInterval -1;
    // writeControl    writeTime;
    // writeInterval   -1;
}


// ************************************************************************* //
